[Killed] Regex
src/config/loader.ts:31:26
  * @returns String with all placeholders resolved.
  */
 function substituteEnvVars(content: string): string {
-  return content.replace(/\$\{([^}]+)\}/g, (_, key: string) => process.env[key] ?? '');
+  return content.replace(/\$\{([^}])\}/g, (_, key: string) => process.env[key] ?? '');
 }
 
killedBy: loadConfigFromFile performs env var substitution in YAML
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "redis://substituted-host:6379"
Received: "${SOME_REDIS_URL}"

[Killed] ConditionalExpression
src/config/loader.ts:49:26
  * @throws {ConfigurationError} If the config is missing required fields.
  */
 export function validateConfig(config: unknown): asserts config is RateLimiterConfig {
-  if (config === null || typeof config !== 'object') {
+  if (config === null || false) {
     throw new ConfigurationError('Config must be an object');
   }
killedBy: validateConfig throws for non-object input
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ConfigurationError
Received constructor: TypeError

Received message: "Cannot use 'in' operator to search for 'redis' in string"

      109 |

[Killed] LogicalOperator
src/config/loader.ts:49:7
  * @throws {ConfigurationError} If the config is missing required fields.
  */
 export function validateConfig(config: unknown): asserts config is RateLimiterConfig {
-  if (config === null || typeof config !== 'object') {
+  if (config === null && typeof config !== 'object') {
     throw new ConfigurationError('Config must be an object');
   }
killedBy: validateConfig throws for null input
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ConfigurationError
Received constructor: TypeError

Received message: "Cannot use 'in' operator to search for 'redis' in null"

      109 |

[Killed] BlockStatement
src/config/loader.ts:56:87
   const obj = config as Record<string, unknown>;
 
   // -- redis ------------------------------------------------------------------
-  if (!('redis' in obj) || obj['redis'] === null || typeof obj['redis'] !== 'object') {
-    throw new ConfigurationError(
-      'Config must contain a "redis" object with connection details (e.g. { url: "redis://..." })',
-    );
-  }
+  if (!('redis' in obj) || obj['redis'] === null || typeof obj['redis'] !== 'object') {}
 
   // -- rules ------------------------------------------------------------------
killedBy: validateConfig throws for missing redis
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ConfigurationError
Received constructor: TypeError

Received message: "Cannot read properties of undefined (reading 'url')"

      172 |     // Validate redis has at least url or cluster

[Killed] ConditionalExpression
src/config/loader.ts:56:53
   const obj = config as Record<string, unknown>;
 
   // -- redis ------------------------------------------------------------------
-  if (!('redis' in obj) || obj['redis'] === null || typeof obj['redis'] !== 'object') {
+  if (!('redis' in obj) || obj['redis'] === null || false) {
     throw new ConfigurationError(
       'Config must contain a "redis" object with connection details (e.g. { url: "redis://..." })',
killedBy: validateConfig — redis guard conditions throws REDIS guard message when redis is a number (typeof check)
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /must contain a "redis" object/
Received string:  "Config \"redis\" must contain at least \"url\" or \"cluster\" connection details"

[Killed] ConditionalExpression
src/config/loader.ts:63:7
   }
 
   // -- rules ------------------------------------------------------------------
-  if (!('rules' in obj)) {
+  if (false) {
     throw new ConfigurationError(
       'Config must contain a "rules" array. Provide an empty array [] if no rules are needed.',
killedBy: validateConfig — exact error messages throws message containing "rules" for missing rules key
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Config must contain a \"rules\" array"
Received message:   "\"rules\" must be an array"

      132 |       } else {
      133 |         stryCov_9fa48("43");
    > 134 |         throw new ConfigurationError(stryMutAct_9fa48("44") ? "" : (stryCov_9fa48("44"), '"rules" must be an array'));

[Killed] BlockStatement
src/config/loader.ts:63:26
   }
 
   // -- rules ------------------------------------------------------------------
-  if (!('rules' in obj)) {
-    throw new ConfigurationError(
-      'Config must contain a "rules" array. Provide an empty array [] if no rules are needed.',
-    );
-  }
+  if (!('rules' in obj)) {}
 
   if (!Array.isArray(obj['rules'])) {
killedBy: validateConfig — exact error messages throws message containing "rules" for missing rules key
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Config must contain a \"rules\" array"
Received message:   "\"rules\" must be an array"

      132 |       } else {
      133 |         stryCov_9fa48("43");
    > 134 |         throw new ConfigurationError(stryMutAct_9fa48("44") ? "" : (stryCov_9fa48("44"), '"rules" must be an array'));

[Killed] StringLiteral
src/config/loader.ts:65:7
   // -- rules ------------------------------------------------------------------
   if (!('rules' in obj)) {
     throw new ConfigurationError(
-      'Config must contain a "rules" array. Provide an empty array [] if no rules are needed.',
+      "",
     );
   }
killedBy: validateConfig — exact error messages throws message containing "rules" for missing rules key
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Config must contain a \"rules\" array"
Received message:   ""

      124 |       } else {
      125 |         stryCov_9fa48("37");
    > 126 |         throw new ConfigurationError(stryMutAct_9fa48("38") ? "" : (stryCov_9fa48("38"), 'Config must contain a "rules" array. Provide an empty array [] if no rules are needed.'));

[Killed] ConditionalExpression
src/config/loader.ts:69:7
     );
   }
 
-  if (!Array.isArray(obj['rules'])) {
+  if (false) {
     throw new ConfigurationError('"rules" must be an array');
   }
killedBy: validateConfig — exact error messages throws "rules" must be an array message
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "\"rules\" must be an array"
Received message:   "rules[0] must be an object"

      147 |           } else {
      148 |             stryCov_9fa48("58");
    > 149 |             throw new ConfigurationError(stryMutAct_9fa48("59") ? `` : (stryCov_9fa48("59"), `rules[${i}] must be an object`));

[Killed] BlockStatement
src/config/loader.ts:69:37
     );
   }
 
-  if (!Array.isArray(obj['rules'])) {
-    throw new ConfigurationError('"rules" must be an array');
-  }
+  if (!Array.isArray(obj['rules'])) {}
 
   const rules = obj['rules'] as unknown[];
killedBy: validateConfig — exact error messages throws "rules" must be an array message
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "\"rules\" must be an array"
Received message:   "rules[0] must be an object"

      147 |           } else {
      148 |             stryCov_9fa48("58");
    > 149 |             throw new ConfigurationError(stryMutAct_9fa48("59") ? `` : (stryCov_9fa48("59"), `rules[${i}] must be an object`));

[Killed] EqualityOperator
src/config/loader.ts:74:19
   }
 
   const rules = obj['rules'] as unknown[];
-  for (let i = 0; i < rules.length; i++) {
+  for (let i = 0; i >= rules.length; i++) {
     const rule = rules[i];
     if (rule === null || typeof rule !== 'object') {
killedBy: validateConfig throws when a rule has no name
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ConfigurationError

Received function did not throw

[Killed] BlockStatement
src/config/loader.ts:74:42
   }
 
   const rules = obj['rules'] as unknown[];
-  for (let i = 0; i < rules.length; i++) {
-    const rule = rules[i];
-    if (rule === null || typeof rule !== 'object') {
-      throw new ConfigurationError(`rules[${i}] must be an object`);
-    }
-    const r = rule as Record<string, unknown>;
-    if (typeof r['name'] !== 'string' || r['name'].trim() === '') {
-      throw new ConfigurationError(`rules[${i}] must have a non-empty "name" string`);
-    }
-    if (!('limits' in r) || r['limits'] === null || typeof r['limits'] !== 'object') {
-      throw new ConfigurationError(
-        `rules[${i}] ("${r['name'] as string}") must have a "limits" object`,
-      );
-    }
-  }
+  for (let i = 0; i < rules.length; i++) {}
 
   // Validate redis has at least url or cluster
killedBy: validateConfig throws when a rule has no name
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ConfigurationError

Received function did not throw

[Killed] LogicalOperator
src/config/loader.ts:76:9
   const rules = obj['rules'] as unknown[];
   for (let i = 0; i < rules.length; i++) {
     const rule = rules[i];
-    if (rule === null || typeof rule !== 'object') {
+    if (rule === null && typeof rule !== 'object') {
       throw new ConfigurationError(`rules[${i}] must be an object`);
     }
killedBy: validateConfig — additional branches throws when a rule item is null (not an object)
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ConfigurationError
Received constructor: TypeError

Received message: "Cannot read properties of null (reading 'name')"

      151 |         }

[Killed] ConditionalExpression
src/config/loader.ts:76:26
   const rules = obj['rules'] as unknown[];
   for (let i = 0; i < rules.length; i++) {
     const rule = rules[i];
-    if (rule === null || typeof rule !== 'object') {
+    if (rule === null || false) {
       throw new ConfigurationError(`rules[${i}] must be an object`);
     }
killedBy: validateConfig — limits guard conditions throws RULE-OBJECT guard message (not name message) when rule is a number
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /rules\[0\] must be an object/
Received string:  "rules[0] must have a non-empty \"name\" string"

[Killed] EqualityOperator
src/config/loader.ts:80:42
       throw new ConfigurationError(`rules[${i}] must be an object`);
     }
     const r = rule as Record<string, unknown>;
-    if (typeof r['name'] !== 'string' || r['name'].trim() === '') {
+    if (typeof r['name'] !== 'string' || r['name'].trim() !== '') {
       throw new ConfigurationError(`rules[${i}] must have a non-empty "name" string`);
     }
killedBy: loadConfigFromEnv returns valid config with defaults when no env vars set
statusReason: ConfigurationError: rules[0] must have a non-empty "name" string

[Killed] ConditionalExpression
src/config/loader.ts:80:9
       throw new ConfigurationError(`rules[${i}] must be an object`);
     }
     const r = rule as Record<string, unknown>;
-    if (typeof r['name'] !== 'string' || r['name'].trim() === '') {
+    if (false) {
       throw new ConfigurationError(`rules[${i}] must have a non-empty "name" string`);
     }
killedBy: validateConfig throws when a rule has no name
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ConfigurationError

Received function did not throw

[Killed] ConditionalExpression
src/config/loader.ts:83:29
     if (typeof r['name'] !== 'string' || r['name'].trim() === '') {
       throw new ConfigurationError(`rules[${i}] must have a non-empty "name" string`);
     }
-    if (!('limits' in r) || r['limits'] === null || typeof r['limits'] !== 'object') {
+    if (!('limits' in r) || false || typeof r['limits'] !== 'object') {
       throw new ConfigurationError(
         `rules[${i}] ("${r['name'] as string}") must have a "limits" object`,
killedBy: validateConfig — limits guard conditions throws when limits key is present but value is null
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ConfigurationError
Received constructor: TypeError

Received message: "Cannot read properties of null (reading 'ip')"

      194 |           } else {

[Killed] EqualityOperator
src/config/loader.ts:83:29
     if (typeof r['name'] !== 'string' || r['name'].trim() === '') {
       throw new ConfigurationError(`rules[${i}] must have a non-empty "name" string`);
     }
-    if (!('limits' in r) || r['limits'] === null || typeof r['limits'] !== 'object') {
+    if (!('limits' in r) || r['limits'] !== null || typeof r['limits'] !== 'object') {
       throw new ConfigurationError(
         `rules[${i}] ("${r['name'] as string}") must have a "limits" object`,
killedBy: loadConfigFromEnv returns valid config with defaults when no env vars set
statusReason: ConfigurationError: rules[0] ("default") must have a "limits" object

[Killed] LogicalOperator
src/config/loader.ts:92:7
 
   // Validate redis has at least url or cluster
   const redis = obj['redis'] as Record<string, unknown>;
-  if (!redis['url'] && !redis['cluster']) {
+  if (!redis['url'] || !redis['cluster']) {
     throw new ConfigurationError(
       'Config "redis" must contain at least "url" or "cluster" connection details',
killedBy: loadConfigFromEnv returns valid config with defaults when no env vars set
statusReason: ConfigurationError: Config "redis" must contain at least "url" or "cluster" connection details

[Killed] ConditionalExpression
src/config/loader.ts:92:7
 
   // Validate redis has at least url or cluster
   const redis = obj['redis'] as Record<string, unknown>;
-  if (!redis['url'] && !redis['cluster']) {
+  if (false) {
     throw new ConfigurationError(
       'Config "redis" must contain at least "url" or "cluster" connection details',
killedBy: validateConfig — additional branches throws when redis has neither url nor cluster
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "must contain at least \"url\" or \"cluster\""

Received function did not throw

[Killed] UpdateOperator
src/config/loader.ts:99:37
   }
 
   // Validate each rule's limit specs have valid values
-  for (let i = 0; i < rules.length; i++) {
+  for (let i = 0; i < rules.length; i--) {
     const r = rules[i] as Record<string, unknown>;
     const limits = r['limits'] as Record<string, unknown>;
killedBy: loadConfigFromEnv returns valid config with defaults when no env vars set
statusReason: TypeError: Cannot read properties of undefined (reading 'limits')

[Killed] BlockStatement
src/config/loader.ts:99:42
   }
 
   // Validate each rule's limit specs have valid values
-  for (let i = 0; i < rules.length; i++) {
-    const r = rules[i] as Record<string, unknown>;
-    const limits = r['limits'] as Record<string, unknown>;
-    for (const dim of ['ip', 'route', 'user', 'userRoute'] as const) {
-      const spec = limits[dim];
-      if (spec !== undefined && spec !== null) {
-        const s = spec as Record<string, unknown>;
-        if (typeof s['limit'] !== 'number' || s['limit'] <= 0) {
-          throw new ConfigurationError(
-            `rules[${i}].limits.${dim}.limit must be a positive number`,
-          );
-        }
-        if (typeof s['window'] !== 'number' || s['window'] <= 0) {
-          throw new ConfigurationError(
-            `rules[${i}].limits.${dim}.window must be a positive number`,
-          );
-        }
-      }
-    }
-  }
+  for (let i = 0; i < rules.length; i++) {}
 }
 
killedBy: validateConfig — additional branches throws when ip limit is not a positive number (zero)
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "limit must be a positive number"

Received function did not throw

[Killed] BlockStatement
src/config/loader.ts:102:70
   for (let i = 0; i < rules.length; i++) {
     const r = rules[i] as Record<string, unknown>;
     const limits = r['limits'] as Record<string, unknown>;
-    for (const dim of ['ip', 'route', 'user', 'userRoute'] as const) {
-      const spec = limits[dim];
-      if (spec !== undefined && spec !== null) {
-        const s = spec as Record<string, unknown>;
-        if (typeof s['limit'] !== 'number' || s['limit'] <= 0) {
-          throw new ConfigurationError(
-            `rules[${i}].limits.${dim}.limit must be a positive number`,
-          );
-        }
-        if (typeof s['window'] !== 'number' || s['window'] <= 0) {
-          throw new ConfigurationError(
-            `rules[${i}].limits.${dim}.window must be a positive number`,
-          );
-        }
-      }
-    }
+    for (const dim of ['ip', 'route', 'user', 'userRoute'] as const) {}
   }
 }
killedBy: validateConfig — additional branches throws when ip limit is not a positive number (zero)
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "limit must be a positive number"

Received function did not throw

[Killed] ConditionalExpression
src/config/loader.ts:104:33
     const limits = r['limits'] as Record<string, unknown>;
     for (const dim of ['ip', 'route', 'user', 'userRoute'] as const) {
       const spec = limits[dim];
-      if (spec !== undefined && spec !== null) {
+      if (spec !== undefined && true) {
         const s = spec as Record<string, unknown>;
         if (typeof s['limit'] !== 'number' || s['limit'] <= 0) {
killedBy: validateConfig — spec validation with null spec (spec !== null check) skips validation when ip spec is explicitly null
statusReason: Error: expect(received).not.toThrow()

Error name:    "TypeError"
Error message: "Cannot read properties of null (reading 'limit')"

      201 |                 stryCov_9fa48("112");
      202 |                 const s = spec as Record<string, unknown>;

[Killed] LogicalOperator
src/config/loader.ts:104:11
     const limits = r['limits'] as Record<string, unknown>;
     for (const dim of ['ip', 'route', 'user', 'userRoute'] as const) {
       const spec = limits[dim];
-      if (spec !== undefined && spec !== null) {
+      if (spec !== undefined || spec !== null) {
         const s = spec as Record<string, unknown>;
         if (typeof s['limit'] !== 'number' || s['limit'] <= 0) {
killedBy: loadConfigFromEnv returns valid config with defaults when no env vars set
statusReason: TypeError: Cannot read properties of undefined (reading 'limit')

[Killed] ConditionalExpression
src/config/loader.ts:106:47
       const spec = limits[dim];
       if (spec !== undefined && spec !== null) {
         const s = spec as Record<string, unknown>;
-        if (typeof s['limit'] !== 'number' || s['limit'] <= 0) {
+        if (typeof s['limit'] !== 'number' || false) {
           throw new ConfigurationError(
             `rules[${i}].limits.${dim}.limit must be a positive number`,
killedBy: validateConfig — additional branches throws when ip limit is not a positive number (zero)
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "limit must be a positive number"

Received function did not throw

[Killed] EqualityOperator
src/config/loader.ts:106:47
       const spec = limits[dim];
       if (spec !== undefined && spec !== null) {
         const s = spec as Record<string, unknown>;
-        if (typeof s['limit'] !== 'number' || s['limit'] <= 0) {
+        if (typeof s['limit'] !== 'number' || s['limit'] < 0) {
           throw new ConfigurationError(
             `rules[${i}].limits.${dim}.limit must be a positive number`,
killedBy: validateConfig — additional branches throws when ip limit is not a positive number (zero)
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "limit must be a positive number"

Received function did not throw

[Killed] EqualityOperator
src/config/loader.ts:111:48
             `rules[${i}].limits.${dim}.limit must be a positive number`,
           );
         }
-        if (typeof s['window'] !== 'number' || s['window'] <= 0) {
+        if (typeof s['window'] !== 'number' || s['window'] < 0) {
           throw new ConfigurationError(
             `rules[${i}].limits.${dim}.window must be a positive number`,
killedBy: validateConfig — additional branches throws when ip window is not a positive number (zero)
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "window must be a positive number"

Received function did not throw

[Killed] ConditionalExpression
src/config/loader.ts:111:13
             `rules[${i}].limits.${dim}.limit must be a positive number`,
           );
         }
-        if (typeof s['window'] !== 'number' || s['window'] <= 0) {
+        if (true) {
           throw new ConfigurationError(
             `rules[${i}].limits.${dim}.window must be a positive number`,
killedBy: loadConfigFromEnv returns valid config with defaults when no env vars set
statusReason: ConfigurationError: rules[0].limits.ip.window must be a positive number

[Killed] StringLiteral
src/config/loader.ts:113:13
         }
         if (typeof s['window'] !== 'number' || s['window'] <= 0) {
           throw new ConfigurationError(
-            `rules[${i}].limits.${dim}.window must be a positive number`,
+            ``,
           );
         }
killedBy: validateConfig — additional branches throws when ip window is not a positive number (zero)
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "window must be a positive number"
Received message:   ""

      214 |                   } else {
      215 |                     stryCov_9fa48("137");
    > 216 |                     throw new ConfigurationError(stryMutAct_9fa48("138") ? `` : (stryCov_9fa48("138"), `rules[${i}].limits.${dim}.window must be a positive number`));

[Killed] BlockStatement
src/config/loader.ts:150:7
   const substituted = substituteEnvVars(raw);
 
   let parsed: unknown;
-  try {
-    parsed = yaml.load(substituted);
-  } catch (err: unknown) {
+  try {} catch (err: unknown) {
     const msg = err instanceof Error ? err.message : String(err);
     throw new ConfigurationError(`Invalid YAML in config file "${resolved}": ${msg}`);
killedBy: loadConfigFromFile loads valid YAML config
statusReason: ConfigurationError: Config must be an object

[Killed] BlockStatement
src/config/loader.ts:152:26
   let parsed: unknown;
   try {
     parsed = yaml.load(substituted);
-  } catch (err: unknown) {
-    const msg = err instanceof Error ? err.message : String(err);
-    throw new ConfigurationError(`Invalid YAML in config file "${resolved}": ${msg}`);
-  }
+  } catch (err: unknown) {}
 
   validateConfig(parsed);
killedBy: loadConfigFromFile — YAML error message content YAML error message contains the file path
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Invalid YAML"
Received string:    "Config must be an object"

[Killed] StringLiteral
src/config/loader.ts:154:34
     parsed = yaml.load(substituted);
   } catch (err: unknown) {
     const msg = err instanceof Error ? err.message : String(err);
-    throw new ConfigurationError(`Invalid YAML in config file "${resolved}": ${msg}`);
+    throw new ConfigurationError(``);
   }
 
killedBy: loadConfigFromFile — YAML error message content YAML error message contains the file path
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] StringLiteral
src/config/loader.ts:191:72
   const env = process.env;
 
   const defaultLimit = parseInt(env['RATE_LIMITER_DEFAULT_LIMIT'] ?? '60', 10);
-  const defaultWindow = parseInt(env['RATE_LIMITER_DEFAULT_WINDOW'] ?? '60', 10);
+  const defaultWindow = parseInt(env['RATE_LIMITER_DEFAULT_WINDOW'] ?? "", 10);
 
   const failurePolicyRaw = env['RATE_LIMITER_FAILURE_POLICY'];
killedBy: loadConfigFromEnv returns valid config with defaults when no env vars set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 60
Received: NaN

[Killed] ConditionalExpression
src/config/loader.ts:195:5
 
   const failurePolicyRaw = env['RATE_LIMITER_FAILURE_POLICY'];
   const failurePolicy: 'open' | 'closed' | 'local' =
-    failurePolicyRaw === 'closed' || failurePolicyRaw === 'local'
+    false || failurePolicyRaw === 'local'
       ? failurePolicyRaw
       : 'open';
killedBy: loadConfigFromEnv sets failure policy from RATE_LIMITER_FAILURE_POLICY=closed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "closed"
Received: "open"

[Killed] ConditionalExpression
src/config/loader.ts:195:38
 
   const failurePolicyRaw = env['RATE_LIMITER_FAILURE_POLICY'];
   const failurePolicy: 'open' | 'closed' | 'local' =
-    failurePolicyRaw === 'closed' || failurePolicyRaw === 'local'
+    failurePolicyRaw === 'closed' || false
       ? failurePolicyRaw
       : 'open';
killedBy: loadConfigFromEnv sets failure policy from RATE_LIMITER_FAILURE_POLICY=local
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "local"
Received: "open"

[Killed] ConditionalExpression
src/config/loader.ts:199:28
       ? failurePolicyRaw
       : 'open';
 
-  const reservoirEnabled = env['RATE_LIMITER_RESERVOIR_ENABLED'] === 'true';
+  const reservoirEnabled = false;
   const batchSize = parseInt(env['RATE_LIMITER_RESERVOIR_BATCH_SIZE'] ?? '10', 10);
   const syncInterval = parseInt(env['RATE_LIMITER_RESERVOIR_SYNC_INTERVAL'] ?? '1000', 10);
killedBy: loadConfigFromEnv RATE_LIMITER_RESERVOIR_ENABLED=true enables reservoir
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/config/loader.ts:199:28
       ? failurePolicyRaw
       : 'open';
 
-  const reservoirEnabled = env['RATE_LIMITER_RESERVOIR_ENABLED'] === 'true';
+  const reservoirEnabled = env['RATE_LIMITER_RESERVOIR_ENABLED'] !== 'true';
   const batchSize = parseInt(env['RATE_LIMITER_RESERVOIR_BATCH_SIZE'] ?? '10', 10);
   const syncInterval = parseInt(env['RATE_LIMITER_RESERVOIR_SYNC_INTERVAL'] ?? '1000', 10);
killedBy: loadConfigFromEnv RATE_LIMITER_RESERVOIR_ENABLED=true enables reservoir
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
src/config/loader.ts:201:80
 
   const reservoirEnabled = env['RATE_LIMITER_RESERVOIR_ENABLED'] === 'true';
   const batchSize = parseInt(env['RATE_LIMITER_RESERVOIR_BATCH_SIZE'] ?? '10', 10);
-  const syncInterval = parseInt(env['RATE_LIMITER_RESERVOIR_SYNC_INTERVAL'] ?? '1000', 10);
+  const syncInterval = parseInt(env['RATE_LIMITER_RESERVOIR_SYNC_INTERVAL'] ?? "", 10);
 
   const circuitBreakerEnabled = env['RATE_LIMITER_CIRCUIT_BREAKER_ENABLED'] === 'true';
killedBy: loadConfigFromEnv — default values when env vars absent syncInterval defaults to 1000 when RATE_LIMITER_RESERVOIR_SYNC_INTERVAL not set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1000
Received: NaN

[Killed] StringLiteral
src/config/loader.ts:201:37
 
   const reservoirEnabled = env['RATE_LIMITER_RESERVOIR_ENABLED'] === 'true';
   const batchSize = parseInt(env['RATE_LIMITER_RESERVOIR_BATCH_SIZE'] ?? '10', 10);
-  const syncInterval = parseInt(env['RATE_LIMITER_RESERVOIR_SYNC_INTERVAL'] ?? '1000', 10);
+  const syncInterval = parseInt(env[""] ?? '1000', 10);
 
   const circuitBreakerEnabled = env['RATE_LIMITER_CIRCUIT_BREAKER_ENABLED'] === 'true';
killedBy: loadConfigFromEnv sets reservoir syncInterval from RATE_LIMITER_RESERVOIR_SYNC_INTERVAL
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2000
Received: 1000

[Killed] ConditionalExpression
src/config/loader.ts:203:33
   const batchSize = parseInt(env['RATE_LIMITER_RESERVOIR_BATCH_SIZE'] ?? '10', 10);
   const syncInterval = parseInt(env['RATE_LIMITER_RESERVOIR_SYNC_INTERVAL'] ?? '1000', 10);
 
-  const circuitBreakerEnabled = env['RATE_LIMITER_CIRCUIT_BREAKER_ENABLED'] === 'true';
+  const circuitBreakerEnabled = true;
 
   const logLevelRaw = env['RATE_LIMITER_LOG_LEVEL'];
killedBy: loadConfigFromEnv — default values when env vars absent circuitBreaker is NOT added when RATE_LIMITER_CIRCUIT_BREAKER_ENABLED is absent
statusReason: Error: expect(received).toBeUndefined()

Received: {"enabled": true, "recoveryTimeout": 30000, "threshold": 5}

[Killed] EqualityOperator
src/config/loader.ts:203:33
   const batchSize = parseInt(env['RATE_LIMITER_RESERVOIR_BATCH_SIZE'] ?? '10', 10);
   const syncInterval = parseInt(env['RATE_LIMITER_RESERVOIR_SYNC_INTERVAL'] ?? '1000', 10);
 
-  const circuitBreakerEnabled = env['RATE_LIMITER_CIRCUIT_BREAKER_ENABLED'] === 'true';
+  const circuitBreakerEnabled = env['RATE_LIMITER_CIRCUIT_BREAKER_ENABLED'] !== 'true';
 
   const logLevelRaw = env['RATE_LIMITER_LOG_LEVEL'];
killedBy: loadConfigFromEnv RATE_LIMITER_CIRCUIT_BREAKER_ENABLED=true enables circuit breaker
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] StringLiteral
src/config/loader.ts:205:27
 
   const circuitBreakerEnabled = env['RATE_LIMITER_CIRCUIT_BREAKER_ENABLED'] === 'true';
 
-  const logLevelRaw = env['RATE_LIMITER_LOG_LEVEL'];
+  const logLevelRaw = env[""];
   const logLevel: 'debug' | 'info' | 'warn' | 'error' =
     logLevelRaw === 'debug' || logLevelRaw === 'warn' || logLevelRaw === 'error'
killedBy: loadConfigFromEnv RATE_LIMITER_LOG_LEVEL sets log level
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "debug"
Received: "info"
