[Killed] ConditionalExpression
src/reservoir/local-reservoir.ts:75:9
    */
   async consume(key: string, cost: number, fetchFn: ReservoirFetchFn): Promise<boolean> {
     let bucket = this.buckets.get(key);
-    if (bucket === undefined) {
+    if (true) {
       bucket = { tokens: 0, lastSync: 0, syncInProgress: false };
       this.buckets.set(key, bucket);
killedBy: LocalReservoir.consume() returns true and decrements tokens when reservoir has enough tokens (no fetchFn call)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/reservoir/local-reservoir.ts:76:58
   async consume(key: string, cost: number, fetchFn: ReservoirFetchFn): Promise<boolean> {
     let bucket = this.buckets.get(key);
     if (bucket === undefined) {
-      bucket = { tokens: 0, lastSync: 0, syncInProgress: false };
+      bucket = { tokens: 0, lastSync: 0, syncInProgress: true };
       this.buckets.set(key, bucket);
     }
killedBy: LocalReservoir.consume() syncInProgress is cleared by finally block — slow path re-entered on next under-budget call
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 9

[Killed] EqualityOperator
src/reservoir/local-reservoir.ts:81:9
     }
 
     // Fast path: enough tokens already cached locally.
-    if (bucket.tokens >= cost) {
+    if (bucket.tokens > cost) {
       bucket.tokens -= cost;
       return true;
killedBy: LocalReservoir.consume() fast-path allows when tokens exactly equals cost (bucket.tokens >= cost boundary)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/reservoir/local-reservoir.ts:81:9
     }
 
     // Fast path: enough tokens already cached locally.
-    if (bucket.tokens >= cost) {
+    if (bucket.tokens < cost) {
       bucket.tokens -= cost;
       return true;
killedBy: LocalReservoir.consume() returns true and decrements tokens when reservoir has enough tokens (no fetchFn call)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 98
Received: -2

[Killed] AssignmentOperator
src/reservoir/local-reservoir.ts:82:7
 
     // Fast path: enough tokens already cached locally.
     if (bucket.tokens >= cost) {
-      bucket.tokens -= cost;
+      bucket.tokens += cost;
       return true;
     }
killedBy: LocalReservoir.consume() returns true and decrements tokens when reservoir has enough tokens (no fetchFn call)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 98
Received: 100

[Killed] BooleanLiteral
src/reservoir/local-reservoir.ts:83:14
     // Fast path: enough tokens already cached locally.
     if (bucket.tokens >= cost) {
       bucket.tokens -= cost;
-      return true;
+      return false;
     }
 
killedBy: LocalReservoir.consume() returns true and decrements tokens when reservoir has enough tokens (no fetchFn call)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/reservoir/local-reservoir.ts:87:33
     }
 
     // Slow path: need to fetch from Redis.
-    if (!bucket.syncInProgress) {
-      // Acquire the sync lock for this bucket so concurrent requests don't
-      // all pile onto Redis simultaneously.
-      bucket.syncInProgress = true;
-      try {
-        const granted = await fetchFn(key);
-        // Keep remainder tokens for subsequent requests.
-        bucket.tokens = Math.max(0, granted - cost);
-        bucket.lastSync = Date.now();
-        return granted >= cost;
-      } finally {
-        bucket.syncInProgress = false;
-      }
-    }
+    if (!bucket.syncInProgress) {}
 
     // Another concurrent request is already fetching — bypass reservoir and
killedBy: LocalReservoir.consume() syncInProgress is cleared by finally block — slow path re-entered on next under-budget call
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 9

[Killed] BooleanLiteral
src/reservoir/local-reservoir.ts:87:9
     }
 
     // Slow path: need to fetch from Redis.
-    if (!bucket.syncInProgress) {
+    if (bucket.syncInProgress) {
       // Acquire the sync lock for this bucket so concurrent requests don't
       // all pile onto Redis simultaneously.
killedBy: LocalReservoir.consume() syncInProgress is cleared by finally block — slow path re-entered on next under-budget call
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 9

[Killed] BooleanLiteral
src/reservoir/local-reservoir.ts:90:31
     if (!bucket.syncInProgress) {
       // Acquire the sync lock for this bucket so concurrent requests don't
       // all pile onto Redis simultaneously.
-      bucket.syncInProgress = true;
+      bucket.syncInProgress = false;
       try {
         const granted = await fetchFn(key);
killedBy: LocalReservoir.consume() concurrent path: no tokens added when result < cost (if result > cost is false)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0

[Killed] BlockStatement
src/reservoir/local-reservoir.ts:91:11
       // Acquire the sync lock for this bucket so concurrent requests don't
       // all pile onto Redis simultaneously.
       bucket.syncInProgress = true;
-      try {
-        const granted = await fetchFn(key);
-        // Keep remainder tokens for subsequent requests.
-        bucket.tokens = Math.max(0, granted - cost);
-        bucket.lastSync = Date.now();
-        return granted >= cost;
-      } finally {
+      try {} finally {
         bucket.syncInProgress = false;
       }
killedBy: LocalReservoir.consume() syncInProgress is cleared by finally block — slow path re-entered on next under-budget call
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 9

[Killed] ArithmeticOperator
src/reservoir/local-reservoir.ts:94:37
       try {
         const granted = await fetchFn(key);
         // Keep remainder tokens for subsequent requests.
-        bucket.tokens = Math.max(0, granted - cost);
+        bucket.tokens = Math.max(0, granted + cost);
         bucket.lastSync = Date.now();
         return granted >= cost;
killedBy: LocalReservoir.consume() returns true and decrements tokens when reservoir has enough tokens (no fetchFn call)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 98
Received: 100

[Killed] MethodExpression
src/reservoir/local-reservoir.ts:94:25
       try {
         const granted = await fetchFn(key);
         // Keep remainder tokens for subsequent requests.
-        bucket.tokens = Math.max(0, granted - cost);
+        bucket.tokens = Math.min(0, granted - cost);
         bucket.lastSync = Date.now();
         return granted >= cost;
killedBy: LocalReservoir.consume() returns true and decrements tokens when reservoir has enough tokens (no fetchFn call)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/reservoir/local-reservoir.ts:96:16
         // Keep remainder tokens for subsequent requests.
         bucket.tokens = Math.max(0, granted - cost);
         bucket.lastSync = Date.now();
-        return granted >= cost;
+        return granted > cost;
       } finally {
         bucket.syncInProgress = false;
killedBy: LocalReservoir.consume() keeps zero tokens (not negative) when granted equals cost exactly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/reservoir/local-reservoir.ts:96:16
         // Keep remainder tokens for subsequent requests.
         bucket.tokens = Math.max(0, granted - cost);
         bucket.lastSync = Date.now();
-        return granted >= cost;
+        return true;
       } finally {
         bucket.syncInProgress = false;
killedBy: LocalReservoir.consume() returns false when fetchFn returns 0 (rate limited)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/reservoir/local-reservoir.ts:97:17
         bucket.tokens = Math.max(0, granted - cost);
         bucket.lastSync = Date.now();
         return granted >= cost;
-      } finally {
-        bucket.syncInProgress = false;
-      }
+      } finally {}
     }
 
killedBy: LocalReservoir.consume() syncInProgress is cleared by finally block — slow path re-entered on next under-budget call
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 9

[Killed] BooleanLiteral
src/reservoir/local-reservoir.ts:98:33
         bucket.lastSync = Date.now();
         return granted >= cost;
       } finally {
-        bucket.syncInProgress = false;
+        bucket.syncInProgress = true;
       }
     }
killedBy: LocalReservoir.consume() syncInProgress is cleared by finally block — slow path re-entered on next under-budget call
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 9

[Killed] ConditionalExpression
src/reservoir/local-reservoir.ts:106:9
     // call fetchFn directly for this request.  Return surplus tokens to the
     // bucket so they are not wasted.
     const result = await fetchFn(key);
-    if (result > cost) {
+    if (true) {
       bucket.tokens += (result - cost);
     }
killedBy: LocalReservoir.consume() concurrent path: no tokens added when result < cost (if result > cost is false)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: -4

[Killed] BlockStatement
src/reservoir/local-reservoir.ts:106:24
     // call fetchFn directly for this request.  Return surplus tokens to the
     // bucket so they are not wasted.
     const result = await fetchFn(key);
-    if (result > cost) {
-      bucket.tokens += (result - cost);
-    }
+    if (result > cost) {}
     return result >= cost;
   }
killedBy: LocalReservoir.consume() concurrent path: surplus tokens (result > cost) are added to bucket
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 13
Received: 4

[Killed] AssignmentOperator
src/reservoir/local-reservoir.ts:107:7
     // bucket so they are not wasted.
     const result = await fetchFn(key);
     if (result > cost) {
-      bucket.tokens += (result - cost);
+      bucket.tokens -= result - cost;
     }
     return result >= cost;
killedBy: LocalReservoir.consume() concurrent path: surplus tokens (result > cost) are added to bucket
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 13
Received: -5

[Killed] ArithmeticOperator
src/reservoir/local-reservoir.ts:107:25
     // bucket so they are not wasted.
     const result = await fetchFn(key);
     if (result > cost) {
-      bucket.tokens += (result - cost);
+      bucket.tokens += (result + cost);
     }
     return result >= cost;
killedBy: LocalReservoir.consume() concurrent path: surplus tokens (result > cost) are added to bucket
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 13
Received: 15

[Killed] EqualityOperator
src/reservoir/local-reservoir.ts:109:12
     if (result > cost) {
       bucket.tokens += (result - cost);
     }
-    return result >= cost;
+    return result < cost;
   }
 
killedBy: LocalReservoir.consume() handles concurrent consume: syncInProgress bucket calls fetchFn directly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/reservoir/local-reservoir.ts:109:12
     if (result > cost) {
       bucket.tokens += (result - cost);
     }
-    return result >= cost;
+    return result > cost;
   }
 
killedBy: LocalReservoir.consume() concurrent path: result === cost returns true (result >= cost, not result > cost)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/reservoir/local-reservoir.ts:120:88
    *
    * @param returnFn Async function that returns `tokens` to Redis for `key`.
    */
-  async flush(returnFn: (key: string, tokens: number) => Promise<void>): Promise<void> {
-    const flushPromises: Promise<void>[] = [];
-
-    for (const [key, bucket] of this.buckets) {
-      if (bucket.tokens > 0) {
-        flushPromises.push(returnFn(key, bucket.tokens));
-      }
-    }
-
-    await Promise.all(flushPromises);
-    this.buckets.clear();
-  }
+  async flush(returnFn: (key: string, tokens: number) => Promise<void>): Promise<void> {}
 
   /**
killedBy: LocalReservoir.flush() calls returnFn for keys with tokens > 0
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "flushKey1", 99

Number of calls: 0

[Killed] BlockStatement
src/reservoir/local-reservoir.ts:123:47
   async flush(returnFn: (key: string, tokens: number) => Promise<void>): Promise<void> {
     const flushPromises: Promise<void>[] = [];
 
-    for (const [key, bucket] of this.buckets) {
-      if (bucket.tokens > 0) {
-        flushPromises.push(returnFn(key, bucket.tokens));
-      }
-    }
+    for (const [key, bucket] of this.buckets) {}
 
     await Promise.all(flushPromises);
killedBy: LocalReservoir.flush() calls returnFn for keys with tokens > 0
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "flushKey1", 99

Number of calls: 0

[Killed] EqualityOperator
src/reservoir/local-reservoir.ts:124:11
     const flushPromises: Promise<void>[] = [];
 
     for (const [key, bucket] of this.buckets) {
-      if (bucket.tokens > 0) {
+      if (bucket.tokens <= 0) {
         flushPromises.push(returnFn(key, bucket.tokens));
       }
killedBy: LocalReservoir.flush() calls returnFn for keys with tokens > 0
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "flushKey1", 99

Number of calls: 0

[Killed] BlockStatement
src/reservoir/local-reservoir.ts:124:30
     const flushPromises: Promise<void>[] = [];
 
     for (const [key, bucket] of this.buckets) {
-      if (bucket.tokens > 0) {
-        flushPromises.push(returnFn(key, bucket.tokens));
-      }
+      if (bucket.tokens > 0) {}
     }
 
killedBy: LocalReservoir.flush() calls returnFn for keys with tokens > 0
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "flushKey1", 99

Number of calls: 0

[Killed] BlockStatement
src/reservoir/local-reservoir.ts:157:17
    * Note: this discards pre-fetched tokens without returning them to Redis.
    * For a graceful return, call {@link flush} instead.
    */
-  clear(): void {
-    this.buckets.clear();
-  }
+  clear(): void {}
 
   /**
killedBy: LocalReservoir.clear() empties all buckets
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 2

[Killed] BooleanLiteral
src/reservoir/local-reservoir.ts:171:38
    */
   needsSync(key: string, nowMs?: number): boolean {
     const bucket = this.buckets.get(key);
-    if (bucket === undefined) return true;
+    if (bucket === undefined) return false;
     const now = nowMs ?? Date.now();
     return now - bucket.lastSync > this.syncInterval;
killedBy: LocalReservoir.needsSync() returns true for unknown key (never synced)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
src/reservoir/local-reservoir.ts:173:12
     const bucket = this.buckets.get(key);
     if (bucket === undefined) return true;
     const now = nowMs ?? Date.now();
-    return now - bucket.lastSync > this.syncInterval;
+    return now + bucket.lastSync > this.syncInterval;
   }
 }
killedBy: LocalReservoir.needsSync() returns false when recently synced (within syncInterval)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/reservoir/local-reservoir.ts:173:12
     const bucket = this.buckets.get(key);
     if (bucket === undefined) return true;
     const now = nowMs ?? Date.now();
-    return now - bucket.lastSync > this.syncInterval;
+    return true;
   }
 }
killedBy: LocalReservoir.needsSync() returns false when recently synced (within syncInterval)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
