[Killed] ConditionalExpression
src/config/loader.ts:207:58
 
   const logLevelRaw = env['RATE_LIMITER_LOG_LEVEL'];
   const logLevel: 'debug' | 'info' | 'warn' | 'error' =
-    logLevelRaw === 'debug' || logLevelRaw === 'warn' || logLevelRaw === 'error'
+    logLevelRaw === 'debug' || logLevelRaw === 'warn' || false
       ? logLevelRaw
       : 'info';
killedBy: loadConfigFromEnv — log level branches RATE_LIMITER_LOG_LEVEL=error sets log level to error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "error"
Received: "info"

[Killed] ConditionalExpression
src/config/loader.ts:207:32
 
   const logLevelRaw = env['RATE_LIMITER_LOG_LEVEL'];
   const logLevel: 'debug' | 'info' | 'warn' | 'error' =
-    logLevelRaw === 'debug' || logLevelRaw === 'warn' || logLevelRaw === 'error'
+    logLevelRaw === 'debug' || false || logLevelRaw === 'error'
       ? logLevelRaw
       : 'info';
killedBy: loadConfigFromEnv — log level branches RATE_LIMITER_LOG_LEVEL=warn sets log level to warn
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "warn"
Received: "info"

[Killed] StringLiteral
src/config/loader.ts:211:40
       ? logLevelRaw
       : 'info';
 
-  const logSampleRate = parseFloat(env['RATE_LIMITER_LOG_SAMPLE_RATE'] ?? '1');
+  const logSampleRate = parseFloat(env[""] ?? '1');
   const metricsBackendRaw = env['RATE_LIMITER_METRICS_BACKEND'];
   const metricsBackend: 'cloudwatch' | 'prometheus' | 'statsd' | 'none' =
killedBy: loadConfigFromEnv RATE_LIMITER_LOG_SAMPLE_RATE sets sample rate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0.1
Received: 1

[Killed] ConditionalExpression
src/config/loader.ts:214:5
   const logSampleRate = parseFloat(env['RATE_LIMITER_LOG_SAMPLE_RATE'] ?? '1');
   const metricsBackendRaw = env['RATE_LIMITER_METRICS_BACKEND'];
   const metricsBackend: 'cloudwatch' | 'prometheus' | 'statsd' | 'none' =
-    metricsBackendRaw === 'cloudwatch' ||
-    metricsBackendRaw === 'prometheus' ||
+    false ||
     metricsBackendRaw === 'statsd'
       ? metricsBackendRaw
killedBy: loadConfigFromEnv RATE_LIMITER_METRICS_BACKEND sets metrics backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "cloudwatch"
Received: "none"

[Killed] ConditionalExpression
src/config/loader.ts:214:5
   const logSampleRate = parseFloat(env['RATE_LIMITER_LOG_SAMPLE_RATE'] ?? '1');
   const metricsBackendRaw = env['RATE_LIMITER_METRICS_BACKEND'];
   const metricsBackend: 'cloudwatch' | 'prometheus' | 'statsd' | 'none' =
-    metricsBackendRaw === 'cloudwatch' ||
+    false ||
     metricsBackendRaw === 'prometheus' ||
     metricsBackendRaw === 'statsd'
killedBy: loadConfigFromEnv RATE_LIMITER_METRICS_BACKEND sets metrics backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "cloudwatch"
Received: "none"

[Killed] ConditionalExpression
src/config/loader.ts:215:5
   const metricsBackendRaw = env['RATE_LIMITER_METRICS_BACKEND'];
   const metricsBackend: 'cloudwatch' | 'prometheus' | 'statsd' | 'none' =
     metricsBackendRaw === 'cloudwatch' ||
-    metricsBackendRaw === 'prometheus' ||
+    false ||
     metricsBackendRaw === 'statsd'
       ? metricsBackendRaw
killedBy: loadConfigFromEnv — metrics backend branches RATE_LIMITER_METRICS_BACKEND=prometheus sets backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "prometheus"
Received: "none"

[Killed] ConditionalExpression
src/config/loader.ts:216:5
   const metricsBackend: 'cloudwatch' | 'prometheus' | 'statsd' | 'none' =
     metricsBackendRaw === 'cloudwatch' ||
     metricsBackendRaw === 'prometheus' ||
-    metricsBackendRaw === 'statsd'
+    false
       ? metricsBackendRaw
       : 'none';
killedBy: loadConfigFromEnv — metrics backend branches RATE_LIMITER_METRICS_BACKEND=statsd sets backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "statsd"
Received: "none"

[Killed] ObjectLiteral
src/config/loader.ts:222:13
 
   const defaultRule: RuleConfig = {
     name: 'default',
-    limits: {
-      ip: { limit: defaultLimit, window: defaultWindow },
-    },
+    limits: {},
   };
 
killedBy: loadConfigFromEnv returns valid config with defaults when no env vars set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 60
Received: undefined

[Killed] ConditionalExpression
src/config/loader.ts:231:11
 
   const config: RateLimiterConfig = {
     redis: {
-      ...(redisUrl !== undefined ? { url: redisUrl } : { url: 'redis://localhost:6379' }),
+      ...(true ? { url: redisUrl } : { url: 'redis://localhost:6379' }),
       ...(env['RATE_LIMITER_REDIS_AUTH'] !== undefined
         ? { password: env['RATE_LIMITER_REDIS_AUTH'] }
killedBy: loadConfigFromEnv returns valid config with defaults when no env vars set
statusReason: ConfigurationError: Config "redis" must contain at least "url" or "cluster" connection details

[Killed] ConditionalExpression
src/config/loader.ts:231:11
 
   const config: RateLimiterConfig = {
     redis: {
-      ...(redisUrl !== undefined ? { url: redisUrl } : { url: 'redis://localhost:6379' }),
+      ...(false ? { url: redisUrl } : { url: 'redis://localhost:6379' }),
       ...(env['RATE_LIMITER_REDIS_AUTH'] !== undefined
         ? { password: env['RATE_LIMITER_REDIS_AUTH'] }
killedBy: loadConfigFromEnv uses RATE_LIMITER_REDIS_URL when set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "redis://my-host:6379"
Received: "redis://localhost:6379"

[Killed] ConditionalExpression
src/config/loader.ts:232:11
   const config: RateLimiterConfig = {
     redis: {
       ...(redisUrl !== undefined ? { url: redisUrl } : { url: 'redis://localhost:6379' }),
-      ...(env['RATE_LIMITER_REDIS_AUTH'] !== undefined
+      ...(true
         ? { password: env['RATE_LIMITER_REDIS_AUTH'] }
         : {}),
killedBy: loadConfigFromEnv — default values when env vars absent password key is NOT present in redis object when RATE_LIMITER_REDIS_AUTH absent
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/config/loader.ts:232:11
   const config: RateLimiterConfig = {
     redis: {
       ...(redisUrl !== undefined ? { url: redisUrl } : { url: 'redis://localhost:6379' }),
-      ...(env['RATE_LIMITER_REDIS_AUTH'] !== undefined
+      ...(env['RATE_LIMITER_REDIS_AUTH'] === undefined
         ? { password: env['RATE_LIMITER_REDIS_AUTH'] }
         : {}),
killedBy: loadConfigFromEnv uses RATE_LIMITER_REDIS_AUTH when set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "super-secret"
Received: undefined

[Killed] StringLiteral
src/config/loader.ts:233:27
     redis: {
       ...(redisUrl !== undefined ? { url: redisUrl } : { url: 'redis://localhost:6379' }),
       ...(env['RATE_LIMITER_REDIS_AUTH'] !== undefined
-        ? { password: env['RATE_LIMITER_REDIS_AUTH'] }
+        ? { password: env[""] }
         : {}),
     },
killedBy: loadConfigFromEnv uses RATE_LIMITER_REDIS_AUTH when set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "super-secret"
Received: undefined

[Killed] ObjectLiteral
src/config/loader.ts:233:11
     redis: {
       ...(redisUrl !== undefined ? { url: redisUrl } : { url: 'redis://localhost:6379' }),
       ...(env['RATE_LIMITER_REDIS_AUTH'] !== undefined
-        ? { password: env['RATE_LIMITER_REDIS_AUTH'] }
+        ? {}
         : {}),
     },
killedBy: loadConfigFromEnv uses RATE_LIMITER_REDIS_AUTH when set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "super-secret"
Received: undefined

[Killed] ObjectLiteral
src/config/loader.ts:245:11
     failure: {
       default: failurePolicy,
       ...(circuitBreakerEnabled
-        ? {
-            circuitBreaker: {
-              enabled: true,
-              threshold: 5,
-              recoveryTimeout: 30000,
-            },
-          }
+        ? {}
         : {}),
     },
killedBy: loadConfigFromEnv RATE_LIMITER_CIRCUIT_BREAKER_ENABLED=true enables circuit breaker
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BooleanLiteral
src/config/loader.ts:247:24
       ...(circuitBreakerEnabled
         ? {
             circuitBreaker: {
-              enabled: true,
+              enabled: false,
               threshold: 5,
               recoveryTimeout: 30000,
killedBy: loadConfigFromEnv RATE_LIMITER_CIRCUIT_BREAKER_ENABLED=true enables circuit breaker
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/config/loader.ts:258:11
       logLevel,
       logSampleRate: isNaN(logSampleRate) ? 1 : logSampleRate,
       metrics: metricsBackend,
-      ...(env['RATE_LIMITER_METRICS_NAMESPACE'] !== undefined
+      ...(false
         ? { namespace: env['RATE_LIMITER_METRICS_NAMESPACE'] }
         : {}),
killedBy: loadConfigFromEnv RATE_LIMITER_METRICS_NAMESPACE sets namespace
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "MyApp/RateLimiter"
Received: undefined

[Killed] EqualityOperator
src/config/loader.ts:258:11
       logLevel,
       logSampleRate: isNaN(logSampleRate) ? 1 : logSampleRate,
       metrics: metricsBackend,
-      ...(env['RATE_LIMITER_METRICS_NAMESPACE'] !== undefined
+      ...(env['RATE_LIMITER_METRICS_NAMESPACE'] === undefined
         ? { namespace: env['RATE_LIMITER_METRICS_NAMESPACE'] }
         : {}),
killedBy: loadConfigFromEnv RATE_LIMITER_METRICS_NAMESPACE sets namespace
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "MyApp/RateLimiter"
Received: undefined

[Killed] LogicalOperator
src/config/loader.ts:284:24
  *   missing or invalid.
  */
 export function loadConfig(filePath?: string): RateLimiterConfig {
-  const resolvedPath = filePath ?? process.env['RATE_LIMITER_CONFIG'];
+  const resolvedPath = filePath && process.env['RATE_LIMITER_CONFIG'];
   if (resolvedPath !== undefined && resolvedPath !== '') {
     return loadConfigFromFile(resolvedPath);
killedBy: loadConfig loads file when explicit filePath provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "redis://file-host:6379"
Received: "redis://localhost:6379"

[Killed] EqualityOperator
src/config/loader.ts:285:37
  */
 export function loadConfig(filePath?: string): RateLimiterConfig {
   const resolvedPath = filePath ?? process.env['RATE_LIMITER_CONFIG'];
-  if (resolvedPath !== undefined && resolvedPath !== '') {
+  if (resolvedPath !== undefined && resolvedPath === '') {
     return loadConfigFromFile(resolvedPath);
   }
killedBy: loadConfig loads file when explicit filePath provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "redis://file-host:6379"
Received: "redis://localhost:6379"

[Killed] BlockStatement
src/config/loader.ts:285:58
  */
 export function loadConfig(filePath?: string): RateLimiterConfig {
   const resolvedPath = filePath ?? process.env['RATE_LIMITER_CONFIG'];
-  if (resolvedPath !== undefined && resolvedPath !== '') {
-    return loadConfigFromFile(resolvedPath);
-  }
+  if (resolvedPath !== undefined && resolvedPath !== '') {}
   return loadConfigFromEnv();
 }
killedBy: loadConfig loads file when explicit filePath provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "redis://file-host:6379"
Received: "redis://localhost:6379"
