[Killed] ArithmeticOperator
src/core/algorithm.ts:24:21
  * @returns         A value in [0, 1]: 1 at the start of a new bucket, 0 at the end.
  */
 export function computeWeight(windowMs: number, nowMs: number): number {
-  const elapsedMs = nowMs % windowMs;
+  const elapsedMs = nowMs * windowMs;
   return (windowMs - elapsedMs) / windowMs;
 }
killedBy: computeWeight returns 1 when elapsed is 0 (start of a new bucket)
statusReason: Error: expect(received).toBeCloseTo(expected, precision)

Expected: 1
Received: -5999999

Expected precision:    10
Expected difference: < 0.00000000005
Received difference:   6000000

[Killed] ArithmeticOperator
src/core/algorithm.ts:25:10
  */
 export function computeWeight(windowMs: number, nowMs: number): number {
   const elapsedMs = nowMs % windowMs;
-  return (windowMs - elapsedMs) / windowMs;
+  return (windowMs - elapsedMs) * windowMs;
 }
 
killedBy: computeWeight returns 1 when elapsed is 0 (start of a new bucket)
statusReason: Error: expect(received).toBeCloseTo(expected, precision)

Expected: 1
Received: 3600000000

Expected precision:    10
Expected difference: < 0.00000000005
Received difference:   3599999999

[Killed] ArithmeticOperator
src/core/algorithm.ts:25:11
  */
 export function computeWeight(windowMs: number, nowMs: number): number {
   const elapsedMs = nowMs % windowMs;
-  return (windowMs - elapsedMs) / windowMs;
+  return (windowMs + elapsedMs) / windowMs;
 }
 
killedBy: computeWeight returns 0.5 when exactly half the window has elapsed
statusReason: Error: expect(received).toBeCloseTo(expected, precision)

Expected: 0.5
Received: 1.5

Expected precision:    10
Expected difference: < 0.00000000005
Received difference:   1

[Killed] ArithmeticOperator
src/core/algorithm.ts:49:10
   nowMs: number,
 ): number {
   const weight = computeWeight(windowMs, nowMs);
-  return prevCount * weight + currCount;
+  return prevCount / weight + currCount;
 }
 
killedBy: computeEffectiveCount matches the documented example (prev=80, curr=30, elapsed=10s, window=60s)
statusReason: Error: expect(received).toBeCloseTo(expected, precision)

Expected: 96.67
Received: 126

Expected precision:    1
Expected difference: < 0.05
Received difference:   29.33

[Killed] ArithmeticOperator
src/core/algorithm.ts:49:10
   nowMs: number,
 ): number {
   const weight = computeWeight(windowMs, nowMs);
-  return prevCount * weight + currCount;
+  return prevCount * weight - currCount;
 }
 
killedBy: computeEffectiveCount matches the documented example (prev=80, curr=30, elapsed=10s, window=60s)
statusReason: Error: expect(received).toBeCloseTo(expected, precision)

Expected: 96.67
Received: 36.66666666666667

Expected precision:    1
Expected difference: < 0.05
Received difference:   60.00333333333333

[Killed] ArithmeticOperator
src/core/algorithm.ts:73:10
   cost: number,
 ): boolean {
   const effective = computeEffectiveCount(prevCount, currCount, windowMs, nowMs);
-  return effective + cost <= limit;
+  return effective - cost <= limit;
 }
 
killedBy: isAllowed denies when effective + cost exceeds limit by 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/core/algorithm.ts:73:10
   cost: number,
 ): boolean {
   const effective = computeEffectiveCount(prevCount, currCount, windowMs, nowMs);
-  return effective + cost <= limit;
+  return true;
 }
 
killedBy: isAllowed denies when effective + cost exceeds limit by 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] MethodExpression
src/core/algorithm.ts:96:10
   limit: number,
 ): number {
   const effective = computeEffectiveCount(prevCount, currCount, windowMs, nowMs);
-  return Math.max(0, Math.floor(limit - effective));
+  return Math.min(0, Math.floor(limit - effective));
 }
 
killedBy: computeRemaining returns floor(limit - effective)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 0

[Killed] ArithmeticOperator
src/core/algorithm.ts:96:33
   limit: number,
 ): number {
   const effective = computeEffectiveCount(prevCount, currCount, windowMs, nowMs);
-  return Math.max(0, Math.floor(limit - effective));
+  return Math.max(0, Math.floor(limit + effective));
 }
 
killedBy: computeRemaining returns 0 when effective equals the limit (not negative)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 200

[Killed] ArithmeticOperator
src/core/algorithm.ts:110:21
  * @returns         Non-negative integer bucket index.
  */
 export function computeBucket(nowMs: number, windowMs: number): number {
-  return Math.floor(nowMs / windowMs);
+  return Math.floor(nowMs * windowMs);
 }
 
killedBy: computeBucket advances by exactly 1 at each window boundary
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 39599940000
Received: 36000000000

[Killed] ArithmeticOperator
src/core/algorithm.ts:126:21
  * @returns         Milliseconds until the current window bucket ends (1–windowMs).
  */
 export function computeTtlMs(windowMs: number, nowMs: number): number {
-  const elapsedMs = nowMs % windowMs;
+  const elapsedMs = nowMs * windowMs;
   return windowMs - elapsedMs;
 }
killedBy: computeTtlMs returns windowMs when elapsed is 0 (full window remaining)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 60000
Received: -359999940000

[Killed] ArithmeticOperator
src/core/algorithm.ts:127:10
  */
 export function computeTtlMs(windowMs: number, nowMs: number): number {
   const elapsedMs = nowMs % windowMs;
-  return windowMs - elapsedMs;
+  return windowMs + elapsedMs;
 }
 
killedBy: computeTtlMs returns windowMs/2 when half the window has elapsed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 30000
Received: 90000

[Killed] ArithmeticOperator
src/core/algorithm.ts:141:10
  */
 export function computeResetAt(nowMs: number, windowMs: number): number {
   const bucket = computeBucket(nowMs, windowMs);
-  return (bucket + 1) * windowMs;
+  return (bucket + 1) / windowMs;
 }
 
killedBy: RateLimiter integration allows the first request
statusReason: RedisConnectionError: Failed to connect to Redis: Command timed out

[Killed] ArithmeticOperator
src/core/algorithm.ts:141:11
  */
 export function computeResetAt(nowMs: number, windowMs: number): number {
   const bucket = computeBucket(nowMs, windowMs);
-  return (bucket + 1) * windowMs;
+  return (bucket - 1) * windowMs;
 }
 
killedBy: RateLimiter integration resetAt is a future Unix epoch milliseconds value
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 1774786923525
Received:   1774786820380
