[Killed] Regex
src/core/key-builder.ts:31:3
 
 /** Matches RFC-4122 UUIDs (case-insensitive). */
 const UUID_RE =
-  /[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}/gi;
+  /[0-9a-f]-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}/gi;
 
 /**
killedBy: normalizeRoute strips UUIDs and replaces with PARAM
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "GET__api_users_PARAM"
Received: "GET__api_users_550e840PARAM"

[Killed] Regex
src/core/key-builder.ts:31:3
 
 /** Matches RFC-4122 UUIDs (case-insensitive). */
 const UUID_RE =
-  /[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}/gi;
+  /[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]-[0-9a-f]{4}-[0-9a-f]{12}/gi;
 
 /**
killedBy: normalizeRoute strips UUIDs and replaces with PARAM
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "GET__api_users_PARAM"
Received: "GET__api_users_550e8400_e29b_41d4_a716_PARAM"

[Killed] Regex
src/core/key-builder.ts:37:22
  * Matches Unix timestamps (10+ consecutive digits) in any position.
  * Applied before NUMERIC_ID_RE to avoid partial matches.
  */
-const TIMESTAMP_RE = /\d{10,}/g;
+const TIMESTAMP_RE = /\d/g;
 
 /**
killedBy: normalizeRoute strips UUIDs and replaces with PARAM
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "GET__api_users_PARAM"
Received: "GET__api_users__PARAMxrlparamPARAMx_"

[Killed] Regex
src/core/key-builder.ts:37:22
  * Matches Unix timestamps (10+ consecutive digits) in any position.
  * Applied before NUMERIC_ID_RE to avoid partial matches.
  */
-const TIMESTAMP_RE = /\d{10,}/g;
+const TIMESTAMP_RE = /\D{10,}/g;
 
 /**
killedBy: normalizeRoute strips UUIDs and replaces with PARAM
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "GET__api_users_PARAM"
Received: "GET_PARAM0xrlparam0x_"

[Killed] Regex
src/core/key-builder.ts:44:23
  * Uses a lookbehind for `/` and lookahead for `/` or end-of-string so that
  * embedded digits like the `2` in `/v2/` are preserved.
  */
-const NUMERIC_ID_RE = /(?<=\/)\d+(?=\/|$)/g;
+const NUMERIC_ID_RE = /(?<=\/)\d+(?=\/)/g;
 
 /** Characters that are not safe to embed in a Redis key are replaced with `_`. */
killedBy: normalizeRoute strips numeric IDs from path segments
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "GET__api_orders_PARAM"
Received: "GET__api_orders_12345"

[Killed] BlockStatement
src/core/key-builder.ts:72:46
  * @throws        {@link KeyBuilderError} if method or path is empty.
  */
 export function normalizeRoute(method: string, path: string): string {
-  if (!method || method.trim().length === 0) {
-    throw new KeyBuilderError('HTTP method must not be empty');
-  }
+  if (!method || method.trim().length === 0) {}
   if (!path || path.trim().length === 0) {
     throw new KeyBuilderError('Route path must not be empty');
killedBy: normalizeRoute throws KeyBuilderError when method is empty
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: KeyBuilderError

Received function did not throw

[Killed] ConditionalExpression
src/core/key-builder.ts:72:7
  * @throws        {@link KeyBuilderError} if method or path is empty.
  */
 export function normalizeRoute(method: string, path: string): string {
-  if (!method || method.trim().length === 0) {
+  if (false) {
     throw new KeyBuilderError('HTTP method must not be empty');
   }
killedBy: normalizeRoute throws KeyBuilderError when method is empty
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: KeyBuilderError

Received function did not throw

[Killed] LogicalOperator
src/core/key-builder.ts:75:7
   if (!method || method.trim().length === 0) {
     throw new KeyBuilderError('HTTP method must not be empty');
   }
-  if (!path || path.trim().length === 0) {
+  if (!path && path.trim().length === 0) {
     throw new KeyBuilderError('Route path must not be empty');
   }
killedBy: normalizeRoute throws KeyBuilderError when path is whitespace-only
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: KeyBuilderError

Received function did not throw

[Killed] BlockStatement
src/core/key-builder.ts:75:42
   if (!method || method.trim().length === 0) {
     throw new KeyBuilderError('HTTP method must not be empty');
   }
-  if (!path || path.trim().length === 0) {
-    throw new KeyBuilderError('Route path must not be empty');
-  }
+  if (!path || path.trim().length === 0) {}
 
   // 1. Strip query string.
killedBy: normalizeRoute throws KeyBuilderError when path is empty
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: KeyBuilderError

Received function did not throw

[Killed] StringLiteral
src/core/key-builder.ts:76:31
     throw new KeyBuilderError('HTTP method must not be empty');
   }
   if (!path || path.trim().length === 0) {
-    throw new KeyBuilderError('Route path must not be empty');
+    throw new KeyBuilderError("");
   }
 
killedBy: normalizeRoute throws with exact message when path is empty
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Route path must not be empty"
Received message:   ""

      132 |       } else {
      133 |         stryCov_9fa48("320");
    > 134 |         throw new KeyBuilderError(stryMutAct_9fa48("321") ? "" : (stryCov_9fa48("321"), 'Route path must not be empty'));

[Killed] MethodExpression
src/core/key-builder.ts:92:17
   const withoutIds = withoutTimestamps.replace(NUMERIC_ID_RE, PH);
 
   // 5. Lowercase.
-  const lower = withoutIds.toLowerCase();
+  const lower = withoutIds.toUpperCase();
 
   // 6. Replace unsafe characters.
killedBy: RateLimiter integration allows the first request
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
src/core/key-builder.ts:101:23
   const normalized = safe.replace(/_0xrlparam0x_/g, 'PARAM');
 
   // 7. Prefix with METHOD_.
-  const upperMethod = method.trim().toUpperCase();
+  const upperMethod = method.toUpperCase();
   return `${upperMethod}_${normalized}`;
 }
killedBy: normalizeRoute trims whitespace from method before using it
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
src/core/key-builder.ts:101:23
   const normalized = safe.replace(/_0xrlparam0x_/g, 'PARAM');
 
   // 7. Prefix with METHOD_.
-  const upperMethod = method.trim().toUpperCase();
+  const upperMethod = method.trim().toLowerCase();
   return `${upperMethod}_${normalized}`;
 }
killedBy: RateLimiter integration allows the first request
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
src/core/key-builder.ts:102:10
 
   // 7. Prefix with METHOD_.
   const upperMethod = method.trim().toUpperCase();
-  return `${upperMethod}_${normalized}`;
+  return ``;
 }
 
killedBy: normalizeRoute strips UUIDs and replaces with PARAM
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "GET__api_users_PARAM"
Received: ""

[Killed] ConditionalExpression
src/core/key-builder.ts:121:7
  * @throws    {@link KeyBuilderError} if the input is empty.
  */
 export function normalizeIP(ip: string): string {
-  if (!ip || ip.trim().length === 0) {
+  if (true) {
     throw new KeyBuilderError('IP address must not be empty');
   }
killedBy: RateLimiter integration allows the first request
statusReason: KeyBuilderError: IP address must not be empty

[Killed] ConditionalExpression
src/core/key-builder.ts:121:7
  * @throws    {@link KeyBuilderError} if the input is empty.
  */
 export function normalizeIP(ip: string): string {
-  if (!ip || ip.trim().length === 0) {
+  if (false) {
     throw new KeyBuilderError('IP address must not be empty');
   }
killedBy: normalizeIP throws KeyBuilderError for empty string
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: KeyBuilderError

Received function did not throw

[Killed] MethodExpression
src/core/key-builder.ts:125:19
     throw new KeyBuilderError('IP address must not be empty');
   }
 
-  const trimmed = ip.trim();
+  const trimmed = ip;
 
   // Detect IPv6: contains a colon.
killedBy: RateLimiter integration allows the first request
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/core/key-builder.ts:128:7
   const trimmed = ip.trim();
 
   // Detect IPv6: contains a colon.
-  if (trimmed.includes(':')) {
+  if (true) {
     // Expand shorthand (e.g. "::1") into full form before splitting.
     const expanded = expandIPv6(trimmed);
killedBy: normalizeIP returns IPv4 addresses unchanged
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "192.168.1.100"
Received: "192.168.1.100::0"

[Killed] BlockStatement
src/core/key-builder.ts:128:30
   const trimmed = ip.trim();
 
   // Detect IPv6: contains a colon.
-  if (trimmed.includes(':')) {
-    // Expand shorthand (e.g. "::1") into full form before splitting.
-    const expanded = expandIPv6(trimmed);
-    const groups = expanded.split(':');
-    // Take the first 4 groups (the /64 network prefix).
-    const prefix = groups.slice(0, 4).join(':');
-    return `${prefix}::0`;
-  }
+  if (trimmed.includes(':')) {}
 
   return trimmed;
killedBy: normalizeIP collapses a full IPv6 address to the /64 prefix
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2001:0db8:85a3:0000::0"
Received: "2001:0db8:85a3:0000:0000:8a2e:0370:7334"

[Killed] StringLiteral
src/core/key-builder.ts:131:35
   if (trimmed.includes(':')) {
     // Expand shorthand (e.g. "::1") into full form before splitting.
     const expanded = expandIPv6(trimmed);
-    const groups = expanded.split(':');
+    const groups = expanded.split("");
     // Take the first 4 groups (the /64 network prefix).
     const prefix = groups.slice(0, 4).join(':');
killedBy: normalizeIP collapses a full IPv6 address to the /64 prefix
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2001:0db8:85a3:0000::0"
Received: "2:0:0:1::0"

[Killed] MethodExpression
src/core/key-builder.ts:133:20
     const expanded = expandIPv6(trimmed);
     const groups = expanded.split(':');
     // Take the first 4 groups (the /64 network prefix).
-    const prefix = groups.slice(0, 4).join(':');
+    const prefix = groups.join(':');
     return `${prefix}::0`;
   }
killedBy: normalizeIP collapses a full IPv6 address to the /64 prefix
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2001:0db8:85a3:0000::0"
Received: "2001:0db8:85a3:0000:0000:8a2e:0370:7334::0"

[Killed] ConditionalExpression
src/core/key-builder.ts:149:7
  */
 function expandIPv6(ip: string): string {
   // Handle the special case of "::" (all zeros).
-  if (ip === '::') {
+  if (true) {
     return '0000:0000:0000:0000:0000:0000:0000:0000';
   }
killedBy: normalizeIP collapses a full IPv6 address to the /64 prefix
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2001:0db8:85a3:0000::0"
Received: "0000:0000:0000:0000::0"

[Killed] EqualityOperator
src/core/key-builder.ts:149:7
  */
 function expandIPv6(ip: string): string {
   // Handle the special case of "::" (all zeros).
-  if (ip === '::') {
+  if (ip !== '::') {
     return '0000:0000:0000:0000:0000:0000:0000:0000';
   }
killedBy: normalizeIP collapses a full IPv6 address to the /64 prefix
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2001:0db8:85a3:0000::0"
Received: "0000:0000:0000:0000::0"

[Killed] ConditionalExpression
src/core/key-builder.ts:154:7
   }
 
   const halves = ip.split('::');
-  if (halves.length === 2) {
+  if (false) {
     const left = halves[0] ? halves[0].split(':') : [];
     const right = halves[1] ? halves[1].split(':') : [];
killedBy: normalizeIP handles compressed IPv6 (::1 loopback)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0000:0000:0000:0000::0"
Received: "0000:0000:0001::0"

[Killed] EqualityOperator
src/core/key-builder.ts:154:7
   }
 
   const halves = ip.split('::');
-  if (halves.length === 2) {
+  if (halves.length !== 2) {
     const left = halves[0] ? halves[0].split(':') : [];
     const right = halves[1] ? halves[1].split(':') : [];
killedBy: normalizeIP handles compressed IPv6 (::1 loopback)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0000:0000:0000:0000::0"
Received: "0000:0000:0001::0"

[Killed] ArrayDeclaration
src/core/key-builder.ts:155:53
 
   const halves = ip.split('::');
   if (halves.length === 2) {
-    const left = halves[0] ? halves[0].split(':') : [];
+    const left = halves[0] ? halves[0].split(':') : ["Stryker was here"];
     const right = halves[1] ? halves[1].split(':') : [];
     const missingGroups = 8 - left.length - right.length;
killedBy: normalizeIP handles compressed IPv6 (::1 loopback)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0000:0000:0000:0000::0"
Received: "Stryker was here:0000:0000:0000::0"

[Survived] ArrayDeclaration
src/core/key-builder.ts:156:54
   const halves = ip.split('::');
   if (halves.length === 2) {
     const left = halves[0] ? halves[0].split(':') : [];
-    const right = halves[1] ? halves[1].split(':') : [];
+    const right = halves[1] ? halves[1].split(':') : ["Stryker was here"];
     const missingGroups = 8 - left.length - right.length;
     const middle = Array<string>(missingGroups).fill('0000');

[Killed] ArithmeticOperator
src/core/key-builder.ts:157:27
   if (halves.length === 2) {
     const left = halves[0] ? halves[0].split(':') : [];
     const right = halves[1] ? halves[1].split(':') : [];
-    const missingGroups = 8 - left.length - right.length;
+    const missingGroups = 8 - left.length + right.length;
     const middle = Array<string>(missingGroups).fill('0000');
     const groups = [...left, ...middle, ...right];
killedBy: normalizeIP missingGroups arithmetic: 8 - left - right (not + right)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2001:0000:0000:0001::0"
Received: "2001:0000:0000:0000::0"

[Killed] ArithmeticOperator
src/core/key-builder.ts:157:27
   if (halves.length === 2) {
     const left = halves[0] ? halves[0].split(':') : [];
     const right = halves[1] ? halves[1].split(':') : [];
-    const missingGroups = 8 - left.length - right.length;
+    const missingGroups = 8 + left.length - right.length;
     const middle = Array<string>(missingGroups).fill('0000');
     const groups = [...left, ...middle, ...right];
killedBy: normalizeIP missingGroups arithmetic: 8 - left - right (not + right)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2001:0000:0000:0001::0"
Received: "2001:0000:0000:0000::0"

[Survived] StringLiteral
src/core/key-builder.ts:158:54
     const left = halves[0] ? halves[0].split(':') : [];
     const right = halves[1] ? halves[1].split(':') : [];
     const missingGroups = 8 - left.length - right.length;
-    const middle = Array<string>(missingGroups).fill('0000');
+    const middle = Array<string>(missingGroups).fill("");
     const groups = [...left, ...middle, ...right];
     return groups.map((g) => g.padStart(4, '0')).join(':');

[Killed] ArrowFunction
src/core/key-builder.ts:160:23
     const missingGroups = 8 - left.length - right.length;
     const middle = Array<string>(missingGroups).fill('0000');
     const groups = [...left, ...middle, ...right];
-    return groups.map((g) => g.padStart(4, '0')).join(':');
+    return groups.map(() => undefined).join(':');
   }
 
killedBy: normalizeIP handles compressed IPv6 (::1 loopback)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0000:0000:0000:0000::0"
Received: ":::::0"

[Killed] StringLiteral
src/core/key-builder.ts:165:12
 
   // No "::" — already fully specified (or malformed; pass through).
   return ip
-    .split(':')
+    .split("")
     .map((g) => g.padStart(4, '0'))
     .join(':');
killedBy: normalizeIP collapses a full IPv6 address to the /64 prefix
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2001:0db8:85a3:0000::0"
Received: "0002:0000:0000:0001::0"

[Killed] ArrowFunction
src/core/key-builder.ts:166:10
   // No "::" — already fully specified (or malformed; pass through).
   return ip
     .split(':')
-    .map((g) => g.padStart(4, '0'))
+    .map(() => undefined)
     .join(':');
 }
killedBy: normalizeIP collapses a full IPv6 address to the /64 prefix
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2001:0db8:85a3:0000::0"
Received: ":::::0"

[Killed] StringLiteral
src/core/key-builder.ts:167:11
   return ip
     .split(':')
     .map((g) => g.padStart(4, '0'))
-    .join(':');
+    .join("");
 }
 
killedBy: normalizeIP collapses a full IPv6 address to the /64 prefix
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2001:0db8:85a3:0000::0"
Received: "20010db885a3000000008a2e03707334::0"

[Killed] LogicalOperator
src/core/key-builder.ts:183:7
  * @throws            {@link KeyBuilderError} if the identifier is empty.
  */
 export function hashIdentifier(identifier: string): string {
-  if (!identifier || identifier.trim().length === 0) {
+  if (!identifier && identifier.trim().length === 0) {
     throw new KeyBuilderError('Identifier must not be empty');
   }
killedBy: hashIdentifier throws KeyBuilderError for whitespace-only identifier
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: KeyBuilderError

Received function did not throw

[Killed] ConditionalExpression
src/core/key-builder.ts:183:7
  * @throws            {@link KeyBuilderError} if the identifier is empty.
  */
 export function hashIdentifier(identifier: string): string {
-  if (!identifier || identifier.trim().length === 0) {
+  if (false) {
     throw new KeyBuilderError('Identifier must not be empty');
   }
killedBy: hashIdentifier throws KeyBuilderError for empty identifier
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: KeyBuilderError

Received function did not throw

[Killed] MethodExpression
src/core/key-builder.ts:186:10
   if (!identifier || identifier.trim().length === 0) {
     throw new KeyBuilderError('Identifier must not be empty');
   }
-  return createHash('sha256').update(identifier, 'utf8').digest('hex').slice(0, 16);
+  return createHash('sha256').update(identifier, 'utf8').digest('hex');
 }
 
killedBy: hashIdentifier returns a string of exactly 16 hex characters
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 16
Received length: 64
Received string: "fcdec6df4d44dbc637c7c5b58efface52a7f8a88535423430255be0bb89bedd8"

[Killed] StringLiteral
src/core/key-builder.ts:201:10
  * @returns       Redis key string, e.g. `rl:v1:{ip:192.168.1.1}:28433334`.
  */
 export function buildIPKey(ip: string, bucket: number): string {
-  return `${KEY_PREFIX}:{ip:${ip}}:${bucket}`;
+  return ``;
 }
 
killedBy: RateLimiter integration reset clears the counter
statusReason: Error: Command timed out

[Killed] StringLiteral
src/core/key-builder.ts:240:10
   route: string,
   bucket: number,
 ): string {
-  return `${KEY_PREFIX}:{user-route:${userHash}:${route}}:${bucket}`;
+  return ``;
 }
 
killedBy: buildUserRouteKey contains the rl:v1: prefix
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "rl:v1:"
Received string:    ""

[Killed] ArithmeticOperator
src/core/key-builder.ts:260:22
   windowMs: number,
 ): [string, string] {
   const currBucket = computeBucket(nowMs, windowMs);
-  const prevBucket = currBucket - 1;
+  const prevBucket = currBucket + 1;
   return [keyFn(currBucket), keyFn(prevBucket)];
 }
killedBy: buildKeyPair curr key bucket is one greater than prev key bucket
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
