[Killed] BlockStatement
src/observability/logger.ts:92:31
       sampleRate: config?.sampleRate ?? 1.0,
       output:
         config?.output ??
-        ((entry: LogEntry) => {
-          process.stdout.write(JSON.stringify(entry) + '\n');
-        }),
+        ((entry: LogEntry) => {}),
     };
   }
killedBy: Logger default output writes JSON to stdout without error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/observability/logger.ts:108:64
    * @param event  Short event name / message.
    * @param fields Optional additional fields to include in the entry.
    */
-  debug(event: string, fields?: Record<string, unknown>): void {
-    this.write('debug', event, fields);
-  }
+  debug(event: string, fields?: Record<string, unknown>): void {}
 
   /**
killedBy: Logger basic output logger.debug() emits at debug level when level is debug
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "debug"
Received: undefined

[Killed] BlockStatement
src/observability/logger.ts:118:63
    * @param event  Short event name / message.
    * @param fields Optional additional fields to include in the entry.
    */
-  info(event: string, fields?: Record<string, unknown>): void {
-    this.write('info', event, fields);
-  }
+  info(event: string, fields?: Record<string, unknown>): void {}
 
   /**
killedBy: Logger basic output logger.info() outputs a JSON entry to the configured output function
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] BlockStatement
src/observability/logger.ts:128:63
    * @param event  Short event name / message.
    * @param fields Optional additional fields to include in the entry.
    */
-  warn(event: string, fields?: Record<string, unknown>): void {
-    this.write('warn', event, fields);
-  }
+  warn(event: string, fields?: Record<string, unknown>): void {}
 
   /**
killedBy: Logger basic output logger.warn() emits at warn level
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "warn"
Received: undefined

[Killed] BlockStatement
src/observability/logger.ts:138:64
    * @param event  Short event name / message.
    * @param fields Optional additional fields to include in the entry.
    */
-  error(event: string, fields?: Record<string, unknown>): void {
-    this.write('error', event, fields);
-  }
+  error(event: string, fields?: Record<string, unknown>): void {}
 
   // -------------------------------------------------------------------------
killedBy: Logger basic output logger.error() emits at error level
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "error"
Received: undefined

[Killed] BlockStatement
src/observability/logger.ts:160:82
    * @param event  Short event name / message.
    * @param fields Optional additional fields to include in the entry.
    */
-  sample(level: LogLevel, event: string, fields?: Record<string, unknown>): void {
-    // Always emit warn/error.
-    if (level === 'warn' || level === 'error') {
-      this.write(level, event, fields);
-      return;
-    }
-
-    // Sample info/debug according to sampleRate.
-    if (Math.random() <= this.config.sampleRate) {
-      this.write(level, event, fields);
-    }
-  }
+  sample(level: LogLevel, event: string, fields?: Record<string, unknown>): void {}
 
   // -------------------------------------------------------------------------
killedBy: Logger.sample sample() always outputs for warn level regardless of sampleRate
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] ConditionalExpression
src/observability/logger.ts:162:29
    */
   sample(level: LogLevel, event: string, fields?: Record<string, unknown>): void {
     // Always emit warn/error.
-    if (level === 'warn' || level === 'error') {
+    if (level === 'warn' || false) {
       this.write(level, event, fields);
       return;
killedBy: Logger.sample sample() always outputs for error level regardless of sampleRate
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] BlockStatement
src/observability/logger.ts:162:48
    */
   sample(level: LogLevel, event: string, fields?: Record<string, unknown>): void {
     // Always emit warn/error.
-    if (level === 'warn' || level === 'error') {
-      this.write(level, event, fields);
-      return;
-    }
+    if (level === 'warn' || level === 'error') {}
 
     // Sample info/debug according to sampleRate.
killedBy: Logger.sample sample() always outputs for warn level regardless of sampleRate
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] EqualityOperator
src/observability/logger.ts:168:9
     }
 
     // Sample info/debug according to sampleRate.
-    if (Math.random() <= this.config.sampleRate) {
+    if (Math.random() > this.config.sampleRate) {
       this.write(level, event, fields);
     }
killedBy: Logger.sample sample() samples at configured rate for info level
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] ConditionalExpression
src/observability/logger.ts:168:9
     }
 
     // Sample info/debug according to sampleRate.
-    if (Math.random() <= this.config.sampleRate) {
+    if (false) {
       this.write(level, event, fields);
     }
killedBy: Logger.sample sample() samples at configured rate for info level
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] ConditionalExpression
src/observability/logger.ts:185:12
    * @returns Whether log entries at this level would be output.
    */
   isEnabled(level: LogLevel): boolean {
-    return this.levelOrder[level] >= this.levelOrder[this.config.level];
+    return false;
   }
 
killedBy: Logger basic output logger.info() outputs a JSON entry to the configured output function
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] EqualityOperator
src/observability/logger.ts:185:12
    * @returns Whether log entries at this level would be output.
    */
   isEnabled(level: LogLevel): boolean {
-    return this.levelOrder[level] >= this.levelOrder[this.config.level];
+    return this.levelOrder[level] < this.levelOrder[this.config.level];
   }
 
killedBy: Logger basic output logger.info() outputs a JSON entry to the configured output function
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] BlockStatement
src/observability/logger.ts:203:11
     level: LogLevel,
     event: string,
     fields?: Record<string, unknown>,
-  ): void {
-    if (!this.isEnabled(level)) return;
-
-    const entry: LogEntry = {
-      ts: new Date().toISOString(),
-      level,
-      event,
-      ...fields,
-    };
-
-    this.config.output(entry);
-  }
+  ): void {}
 }
 
killedBy: Logger basic output logger.info() outputs a JSON entry to the configured output function
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] ConditionalExpression
src/observability/logger.ts:204:9
     event: string,
     fields?: Record<string, unknown>,
   ): void {
-    if (!this.isEnabled(level)) return;
+    if (true) return;
 
     const entry: LogEntry = {
killedBy: Logger basic output logger.info() outputs a JSON entry to the configured output function
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] ConditionalExpression
src/observability/logger.ts:204:9
     event: string,
     fields?: Record<string, unknown>,
   ): void {
-    if (!this.isEnabled(level)) return;
+    if (false) return;
 
     const entry: LogEntry = {
killedBy: Logger level filtering logger.debug() is skipped when level is info
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received array:  [{"event": "hidden.debug", "level": "debug", "ts": "2026-03-29T12:23:20.492Z"}]
