[Killed] BlockStatement
src/observability/metrics.ts:105:76
   readonly gaugeValues = new Map<string, number>();
 
   /** @inheritdoc */
-  increment(name: string, _tags?: Record<string, string>, value = 1): void {
-    this.counters.set(name, (this.counters.get(name) ?? 0) + value);
-  }
+  increment(name: string, _tags?: Record<string, string>, value = 1): void {}
 
   /** @inheritdoc */
killedBy: InMemoryMetrics increment accumulates counter values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] ArithmeticOperator
src/observability/metrics.ts:106:29
 
   /** @inheritdoc */
   increment(name: string, _tags?: Record<string, string>, value = 1): void {
-    this.counters.set(name, (this.counters.get(name) ?? 0) + value);
+    this.counters.set(name, (this.counters.get(name) ?? 0) - value);
   }
 
killedBy: InMemoryMetrics increment accumulates counter values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: -3

[Killed] BlockStatement
src/observability/metrics.ts:110:80
   }
 
   /** @inheritdoc */
-  histogram(name: string, value: number, _tags?: Record<string, string>): void {
-    const arr = this.histogramValues.get(name) ?? [];
-    arr.push(value);
-    this.histogramValues.set(name, arr);
-  }
+  histogram(name: string, value: number, _tags?: Record<string, string>): void {}
 
   /** @inheritdoc */
killedBy: InMemoryMetrics histogram stores observed values in order
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 2.5, 0.8]
Received: undefined

[Killed] BlockStatement
src/observability/metrics.ts:117:76
   }
 
   /** @inheritdoc */
-  gauge(name: string, value: number, _tags?: Record<string, string>): void {
-    this.gaugeValues.set(name, value);
-  }
+  gauge(name: string, value: number, _tags?: Record<string, string>): void {}
 
   /** @inheritdoc */
killedBy: InMemoryMetrics gauge stores the latest value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: undefined

[Killed] BlockStatement
src/observability/metrics.ts:127:17
   /**
    * Clear all stored metrics.  Useful for resetting state between tests.
    */
-  reset(): void {
-    this.counters.clear();
-    this.histogramValues.clear();
-    this.gaugeValues.clear();
-  }
+  reset(): void {}
 }
 
killedBy: InMemoryMetrics reset clears all counters, histograms, and gauges
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
src/observability/metrics.ts:181:5
  */
 export function createMetrics(backend?: string): MetricsBackend {
   switch (backend) {
-    case 'memory':
-      return new InMemoryMetrics();
+    case 'memory':
     case 'cloudwatch':
     case 'prometheus':
killedBy: createMetrics createMetrics("memory") returns InMemoryMetrics
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: InMemoryMetrics
Received constructor: NoopMetrics

[Killed] StringLiteral
src/observability/metrics.ts:181:10
  */
 export function createMetrics(backend?: string): MetricsBackend {
   switch (backend) {
-    case 'memory':
+    case "":
       return new InMemoryMetrics();
     case 'cloudwatch':
killedBy: createMetrics createMetrics("memory") returns InMemoryMetrics
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: InMemoryMetrics
Received constructor: NoopMetrics

[Killed] StringLiteral
src/observability/metrics.ts:183:10
   switch (backend) {
     case 'memory':
       return new InMemoryMetrics();
-    case 'cloudwatch':
+    case "":
     case 'prometheus':
     case 'statsd':
killedBy: createMetrics createMetrics("cloudwatch") returns NoopMetrics and writes "not yet implemented" to stderr
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "not yet implemented"
Received: "[rate-limiter/metrics] Unknown backend \"cloudwatch\"; using noop
"

Number of calls: 1

[Killed] ConditionalExpression
src/observability/metrics.ts:185:5
       return new InMemoryMetrics();
     case 'cloudwatch':
     case 'prometheus':
-    case 'statsd':
-      process.stderr.write(
-        `[rate-limiter/metrics] Backend "${backend}" is not yet implemented; using noop\n`,
-      );
-      return new NoopMetrics();
+    case 'statsd':
     case 'none':
     case undefined:
killedBy: createMetrics createMetrics("cloudwatch") returns NoopMetrics and writes "not yet implemented" to stderr
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "not yet implemented"

Number of calls: 0

[Killed] StringLiteral
src/observability/metrics.ts:190:10
         `[rate-limiter/metrics] Backend "${backend}" is not yet implemented; using noop\n`,
       );
       return new NoopMetrics();
-    case 'none':
+    case "":
     case undefined:
       return new NoopMetrics();
killedBy: createMetrics createMetrics("none") does NOT write to stderr
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "[rate-limiter/metrics] Unknown backend \"none\"; using noop
"

[Killed] ConditionalExpression
src/observability/metrics.ts:191:5
       );
       return new NoopMetrics();
     case 'none':
-    case undefined:
-      return new NoopMetrics();
+    case undefined:
     default:
       process.stderr.write(
killedBy: createMetrics createMetrics("none") does NOT write to stderr
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "[rate-limiter/metrics] Unknown backend \"none\"; using noop
"
