[Killed] ConditionalExpression
src/redis/circuit-breaker.ts:76:7
    */
   allowRequest(): boolean {
     switch (this.state) {
-      case 'closed':
-        return true
+      case 'closed':
 
       case 'open': {
killedBy: CircuitBreaker initial state allowRequest() keeps state as closed — does not transition to half-open
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "closed"
Received: "half-open"

[Killed] BooleanLiteral
src/redis/circuit-breaker.ts:77:16
   allowRequest(): boolean {
     switch (this.state) {
       case 'closed':
-        return true
+        return false
 
       case 'open': {
killedBy: CircuitBreaker initial state allowRequest() returns true when closed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/redis/circuit-breaker.ts:79:7
       case 'closed':
         return true
 
-      case 'open': {
-        const elapsed = Date.now() - this.lastFailureTime
-        if (elapsed >= this.config.recoveryTimeout) {
-          this.state = 'half-open'
-          return true
-        }
-        return false
-      }
+      case 'open':
 
       case 'half-open':
killedBy: CircuitBreaker closed → open transition allowRequest() returns false immediately after opening
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/redis/circuit-breaker.ts:79:20
       case 'closed':
         return true
 
-      case 'open': {
-        const elapsed = Date.now() - this.lastFailureTime
-        if (elapsed >= this.config.recoveryTimeout) {
-          this.state = 'half-open'
-          return true
-        }
-        return false
-      }
+      case 'open': {}
 
       case 'half-open':
killedBy: CircuitBreaker closed → open transition allowRequest() returns false immediately after opening
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArithmeticOperator
src/redis/circuit-breaker.ts:80:25
         return true
 
       case 'open': {
-        const elapsed = Date.now() - this.lastFailureTime
+        const elapsed = Date.now() + this.lastFailureTime
         if (elapsed >= this.config.recoveryTimeout) {
           this.state = 'half-open'
killedBy: CircuitBreaker closed → open transition allowRequest() returns false immediately after opening
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/redis/circuit-breaker.ts:81:53
 
       case 'open': {
         const elapsed = Date.now() - this.lastFailureTime
-        if (elapsed >= this.config.recoveryTimeout) {
-          this.state = 'half-open'
-          return true
-        }
+        if (elapsed >= this.config.recoveryTimeout) {}
         return false
       }
killedBy: CircuitBreaker open state allowRequest() transitions to half-open after recovery timeout elapses
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/redis/circuit-breaker.ts:81:13
 
       case 'open': {
         const elapsed = Date.now() - this.lastFailureTime
-        if (elapsed >= this.config.recoveryTimeout) {
+        if (false) {
           this.state = 'half-open'
           return true
killedBy: CircuitBreaker open state allowRequest() transitions to half-open after recovery timeout elapses
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/redis/circuit-breaker.ts:83:18
         const elapsed = Date.now() - this.lastFailureTime
         if (elapsed >= this.config.recoveryTimeout) {
           this.state = 'half-open'
-          return true
+          return false
         }
         return false
killedBy: CircuitBreaker open state allowRequest() transitions to half-open after recovery timeout elapses
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/redis/circuit-breaker.ts:89:16
       }
 
       case 'half-open':
-        return true
+        return false
     }
   }
killedBy: CircuitBreaker half-open → closed transition allowRequest() returns true in half-open state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/redis/circuit-breaker.ts:100:25
    * - In `half-open` state: transitions back to `closed` and resets all counters.
    * - In `open` state: no effect (success not expected without passing through half-open).
    */
-  recordSuccess(): void {
-    if (this.state === 'half-open') {
-      this.state = 'closed'
-      this.failureCount = 0
-      this.lastFailureTime = 0
-    } else if (this.state === 'closed') {
-      // Reset accumulating failures on any success
-      this.failureCount = 0
-    }
-  }
+  recordSuccess(): void {}
 
   /**
killedBy: CircuitBreaker half-open → closed transition recordSuccess() in half-open transitions to closed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "closed"
Received: "half-open"

[Killed] ConditionalExpression
src/redis/circuit-breaker.ts:101:9
    * - In `open` state: no effect (success not expected without passing through half-open).
    */
   recordSuccess(): void {
-    if (this.state === 'half-open') {
+    if (false) {
       this.state = 'closed'
       this.failureCount = 0
killedBy: CircuitBreaker half-open → closed transition recordSuccess() in half-open transitions to closed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "closed"
Received: "half-open"

[Killed] ConditionalExpression
src/redis/circuit-breaker.ts:101:9
    * - In `open` state: no effect (success not expected without passing through half-open).
    */
   recordSuccess(): void {
-    if (this.state === 'half-open') {
+    if (true) {
       this.state = 'closed'
       this.failureCount = 0
killedBy: CircuitBreaker recordSuccess() in open state does NOT change state from open to closed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "open"
Received: "closed"

[Killed] ConditionalExpression
src/redis/circuit-breaker.ts:105:16
       this.state = 'closed'
       this.failureCount = 0
       this.lastFailureTime = 0
-    } else if (this.state === 'closed') {
+    } else if (true) {
       // Reset accumulating failures on any success
       this.failureCount = 0
killedBy: RateLimiter integration allows the first request
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/redis/circuit-breaker.ts:105:16
       this.state = 'closed'
       this.failureCount = 0
       this.lastFailureTime = 0
-    } else if (this.state === 'closed') {
+    } else if (this.state !== 'closed') {
       // Reset accumulating failures on any success
       this.failureCount = 0
killedBy: RateLimiter integration allows the first request
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/redis/circuit-breaker.ts:118:25
    * - In `half-open` state: transitions back to `open` and records the failure time.
    * - In `open` state: updates the last failure time (keeps the circuit open).
    */
-  recordFailure(): void {
-    this.lastFailureTime = Date.now()
-
-    switch (this.state) {
-      case 'closed':
-        this.failureCount++
-        if (this.failureCount >= this.config.threshold) {
-          this.state = 'open'
-        }
-        break
-
-      case 'half-open':
-        this.state = 'open'
-        break
-
-      case 'open':
-        // Already open; update lastFailureTime (already set above) to extend the timeout
-        break
-    }
-  }
+  recordFailure(): void {}
 
   /**
killedBy: CircuitBreaker closed → open transition opens after reaching the default threshold of 5 failures
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "open"
Received: "closed"

[Killed] ConditionalExpression
src/redis/circuit-breaker.ts:122:7
     this.lastFailureTime = Date.now()
 
     switch (this.state) {
-      case 'closed':
-        this.failureCount++
-        if (this.failureCount >= this.config.threshold) {
-          this.state = 'open'
-        }
-        break
+      case 'closed':
 
       case 'half-open':
killedBy: CircuitBreaker closed → open transition opens after reaching the default threshold of 5 failures
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "closed"
Received: "open"

[Killed] UpdateOperator
src/redis/circuit-breaker.ts:123:9
 
     switch (this.state) {
       case 'closed':
-        this.failureCount++
+        this.failureCount--
         if (this.failureCount >= this.config.threshold) {
           this.state = 'open'
killedBy: CircuitBreaker closed → open transition opens after reaching the default threshold of 5 failures
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "open"
Received: "closed"

[Killed] ConditionalExpression
src/redis/circuit-breaker.ts:124:13
     switch (this.state) {
       case 'closed':
         this.failureCount++
-        if (this.failureCount >= this.config.threshold) {
+        if (false) {
           this.state = 'open'
         }
killedBy: CircuitBreaker closed → open transition opens after reaching the default threshold of 5 failures
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "open"
Received: "closed"

[Killed] BlockStatement
src/redis/circuit-breaker.ts:124:57
     switch (this.state) {
       case 'closed':
         this.failureCount++
-        if (this.failureCount >= this.config.threshold) {
-          this.state = 'open'
-        }
+        if (this.failureCount >= this.config.threshold) {}
         break
 
killedBy: CircuitBreaker closed → open transition opens after reaching the default threshold of 5 failures
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "open"
Received: "closed"

[Killed] ConditionalExpression
src/redis/circuit-breaker.ts:129:7
         }
         break
 
-      case 'half-open':
-        this.state = 'open'
-        break
+      case 'half-open':
 
       case 'open':
killedBy: CircuitBreaker half-open → open transition recordFailure() in half-open transitions back to open
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "open"
Received: "half-open"

[Survived] ConditionalExpression
src/redis/circuit-breaker.ts:133:7
         this.state = 'open'
         break
 
-      case 'open':
-        // Already open; update lastFailureTime (already set above) to extend the timeout
-        break
+      case 'open':
     }
   }

[Killed] BlockStatement
src/redis/circuit-breaker.ts:143:17
    * Resets the circuit breaker to the initial `closed` state.
    * Clears all failure counters. Useful for testing or manual admin overrides.
    */
-  reset(): void {
-    this.state = 'closed'
-    this.failureCount = 0
-    this.lastFailureTime = 0
-  }
+  reset(): void {}
 }
 
killedBy: CircuitBreaker reset() resets to closed state from open
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "closed"
Received: "open"
